InformationRegisters/ОснованияПолномочийОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОснованияПолномочийОтветственныхЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОснованиеПодписи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОснованияПолномочийОтветственныхЛиц/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Заголовок", Заголовок);
	Параметры.Свойство("ОрганизацияСсылка", Организация);
	Параметры.Свойство("ФизическоеЛицо", ФизическоеЛицо);
	Параметры.Свойство("РежимВыбора", Элементы.Список.РежимВыбора);

	Если ЗначениеЗаполнено(Организация) И Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ПоказыватьСписокФизическихЛиц = Истина;
	КонецЕсли;
	
	Элементы.СписокФизическиеЛица.Видимость = ПоказыватьСписокФизическихЛиц;
	
	Если ЗначениеЗаполнено(Организация) Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Организация", Организация, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		Элементы.Организация.Видимость = Ложь;
		Элементы.ФизическоеЛицо.Видимость = Ложь;

		Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "ФизическоеЛицо", ФизическоеЛицо, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		Иначе
			ЗаполнитьСписокФизическихЛиц();
		КонецЕсли;

	КонецЕсли;

	ДатаОтбора = ТекущаяДатаСеанса();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ОтборПоДате", ДатаОтбора);
	УстановитьОтбор(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьНеактуальныеОснованияПриИзменении(Элемент)
	
	УстановитьОтбор(ЭтотОбъект, НЕ ПоказыватьНеактуальныеОснования);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокФизическиеЛица

&НаКлиенте
Процедура ФизическиеЛицаПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокФизическиеЛица.ТекущаяСтрока <> Неопределено Тогда
		ПодключитьОбработчикОжидания("ОбработкаОжидания", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Если ПоказыватьСписокФизическихЛиц Тогда
		ЗаполнитьСписокФизическихЛиц();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ПоказыватьСписокФизическихЛиц Тогда
		ЗаполнитьСписокФизическихЛиц();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтбор(Форма, Использование = Истина)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Форма.Список, "ОснованиеАктуальное", Истина, ВидСравненияКомпоновкиДанных.Равно,, Использование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	
	Если Элементы.СписокФизическиеЛица.ТекущаяСтрока <> Неопределено Тогда
		
		ТекущееЗначение = Элементы.СписокФизическиеЛица.ТекущиеДанные.Значение;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ФизическоеЛицо", ТекущееЗначение, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФизическихЛиц()
	СписокФизическиеЛица.ЗагрузитьЗначения(
		РегистрыСведений.ОснованияПолномочийОтветственныхЛиц.ФизическиеЛицаОрганизации(Организация));
КонецПроцедуры

#КонецОбласти
